Revit 2027 API
ImportOptions3DM(ImportOptions3DM) Constructor
 Constructs a new instance of ImportOptions3DM as a copy of the provided import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImportOptions3DM(
	ImportOptions3DM option
)
Public Sub New (
	option As ImportOptions3DM
)
public:
ImportOptions3DM(
	ImportOptions3DM^ option
)
new :
        option : ImportOptions3DM -> ImportOptions3DM
Parameters
option ImportOptions3DM
 The 3DM import options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImportOptions3DM Class
ImportOptions3DM Overload
Autodesk.Revit.DB Namespace